In [15]:
import seaborn as sns

1+1

In [16]:
df = sns.load_dataset('titanic')
df.head()
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Mean value imputation

In [17]:
df['Age_mean']= df['age'].fillna(df['age'].mean())
df[['Age_mean','age']]

      Age_mean   age
0    22.000000  22.0
1    38.000000  38.0
2    26.000000  26.0
3    35.000000  35.0
4    35.000000  35.0
..         ...   ...
886  27.000000  27.0
887  19.000000  19.0
888  29.699118   NaN
889  26.000000  26.0
890  32.000000  32.0

[891 rows x 2 columns]

Median value imputation

In [18]:
df['Age_median']= df['age'].fillna(df['age'].median())
df[['Age_median','age']]

     Age_median   age
0          22.0  22.0
1          38.0  38.0
2          26.0  26.0
3          35.0  35.0
4          35.0  35.0
..          ...   ...
886        27.0  27.0
887        19.0  19.0
888        28.0   NaN
889        26.0  26.0
890        32.0  32.0

[891 rows x 2 columns]

Mode value Imputation

In [ ]:
df['embarked'].unique()
df['embarked'].isnull().sum()

mode_value = df['embarked'].mode()[0]
df['embarked_mode'] = df['embarked'].fillna(mode_value)

python Code Sample
df['embarked_mode'].isnull().sum()